In [2]:
import numpy as np
import pandas as pd

df = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "B2": pd.date_range("20130101", periods=6),
        "C": pd.Series([1, 3, 5, np.nan, 6, 8], dtype="float32"),
        "D": np.arange(1, 7),
        "E": pd.Categorical(["test", "train", "test", "train", "one", "train"]),
        "F": "foo",
    }
)

In [3]:
df[0:2]

     A          B         B2    C  D      E    F
0  1.0 2013-01-02 2013-01-01  1.0  1   test  foo
1  1.0 2013-01-02 2013-01-02  3.0  2  train  foo

In [4]:
df[["E", "F"]]

       E    F
0   test  foo
1  train  foo
2   test  foo
3  train  foo
4    one  foo
5  train  foo

In [5]:
df.select_dtypes(include=[np.number])

     A    C  D
0  1.0  1.0  1
1  1.0  3.0  2
2  1.0  5.0  3
3  1.0  NaN  4
4  1.0  6.0  5
5  1.0  8.0  6

## loc vs iloc
Purely integer-location based indexing for selection by position.

In [6]:
df.iloc[0:2]

     A          B         B2    C  D      E    F
0  1.0 2013-01-02 2013-01-01  1.0  1   test  foo
1  1.0 2013-01-02 2013-01-02  3.0  2  train  foo

In [7]:
df.iloc[[True, True, False, False, False, False]]

     A          B         B2    C  D      E    F
0  1.0 2013-01-02 2013-01-01  1.0  1   test  foo
1  1.0 2013-01-02 2013-01-02  3.0  2  train  foo

In [8]:
df.iloc[0:2, 2]

0   2013-01-01
1   2013-01-02
Name: B2, dtype: datetime64[ns]

In [9]:
df.iloc[0:2, 1:2]

           B
0 2013-01-02
1 2013-01-02

Access a group of rows and columns by label(s) or a boolean array.

In [10]:
df.loc[0:2]

     A          B         B2    C  D      E    F
0  1.0 2013-01-02 2013-01-01  1.0  1   test  foo
1  1.0 2013-01-02 2013-01-02  3.0  2  train  foo
2  1.0 2013-01-02 2013-01-03  5.0  3   test  foo

In [11]:
df.loc[0:2, "B"]

0   2013-01-02
1   2013-01-02
2   2013-01-02
Name: B, dtype: datetime64[ns]

In [12]:
df.loc[0:2, ["A", "B"]]

     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02
2  1.0 2013-01-02

## Boolean indexing

In [13]:
df[df["E"] == "test"]

     A          B         B2    C  D     E    F
0  1.0 2013-01-02 2013-01-01  1.0  1  test  foo
2  1.0 2013-01-02 2013-01-03  5.0  3  test  foo

In [14]:
df[df["E"].isin(["test", "train"])]

     A          B         B2    C  D      E    F
0  1.0 2013-01-02 2013-01-01  1.0  1   test  foo
1  1.0 2013-01-02 2013-01-02  3.0  2  train  foo
2  1.0 2013-01-02 2013-01-03  5.0  3   test  foo
3  1.0 2013-01-02 2013-01-04  NaN  4  train  foo
5  1.0 2013-01-02 2013-01-06  8.0  6  train  foo